MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13275/mcu.h
// Register: CLCnGLS3
#define CLCnGLS3 CLCnGLS3
extern volatile unsigned char           CLCnGLS3            __at(0x695);
#ifndef _LIB_BUILD
asm("CLCnGLS3 equ 0695h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G4D1N                  :1;
        unsigned G4D1T                  :1;
        unsigned G4D2N                  :1;
        unsigned G4D2T                  :1;
        unsigned G4D3N                  :1;
        unsigned G4D3T                  :1;
        unsigned G4D4N                  :1;
        unsigned G4D4T                  :1;
    };
} CLCnGLS3bits_t;
extern volatile CLCnGLS3bits_t CLCnGLS3bits __at(0x695);
// bitfield macros
#define _CLCnGLS3_G4D1N_POSN                                0x0
#define _CLCnGLS3_G4D1N_POSITION                            0x0
#define _CLCnGLS3_G4D1N_SIZE                                0x1
#define _CLCnGLS3_G4D1N_LENGTH                              0x1
#define _CLCnGLS3_G4D1N_MASK                                0x1
#define _CLCnGLS3_G4D1T_POSN                                0x1
#define _CLCnGLS3_G4D1T_POSITION                            0x1
#define _CLCnGLS3_G4D1T_SIZE                                0x1
#define _CLCnGLS3_G4D1T_LENGTH                              0x1
#define _CLCnGLS3_G4D1T_MASK                                0x2
#define _CLCnGLS3_G4D2N_POSN                                0x2
#define _CLCnGLS3_G4D2N_POSITION                            0x2
#define _CLCnGLS3_G4D2N_SIZE                                0x1
#define _CLCnGLS3_G4D2N_LENGTH                              0x1
#define _CLCnGLS3_G4D2N_MASK                                0x4
#define _CLCnGLS3_G4D2T_POSN                                0x3
#define _CLCnGLS3_G4D2T_POSITION                            0x3
#define _CLCnGLS3_G4D2T_SIZE                                0x1
#define _CLCnGLS3_G4D2T_LENGTH                              0x1
#define _CLCnGLS3_G4D2T_MASK                                0x8
#define _CLCnGLS3_G4D3N_POSN                                0x4
#define _CLCnGLS3_G4D3N_POSITION                            0x4
#define _CLCnGLS3_G4D3N_SIZE                                0x1
#define _CLCnGLS3_G4D3N_LENGTH                              0x1
#define _CLCnGLS3_G4D3N_MASK                                0x10
#define _CLCnGLS3_G4D3T_POSN                                0x5
#define _CLCnGLS3_G4D3T_POSITION                            0x5
#define _CLCnGLS3_G4D3T_SIZE                                0x1
#define _CLCnGLS3_G4D3T_LENGTH                              0x1
#define _CLCnGLS3_G4D3T_MASK                                0x20
#define _CLCnGLS3_G4D4N_POSN                                0x6
#define _CLCnGLS3_G4D4N_POSITION                            0x6
#define _CLCnGLS3_G4D4N_SIZE                                0x1
#define _CLCnGLS3_G4D4N_LENGTH                              0x1
#define _CLCnGLS3_G4D4N_MASK                                0x40
#define _CLCnGLS3_G4D4T_POSN                                0x7
#define _CLCnGLS3_G4D4T_POSITION                            0x7
#define _CLCnGLS3_G4D4T_SIZE                                0x1
#define _CLCnGLS3_G4D4T_LENGTH                              0x1
#define _CLCnGLS3_G4D4T_MASK                                0x80

// Register: CLCSELECT
#define CLCSELECT CLCSELECT
extern volatile unsigned char           CLCSELECT           __at(0x696);
#ifndef _LIB_BUILD
asm("CLCSELECT equ 0696h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLCT                   :8;
    };
    struct {
        unsigned SLCT0                  :1;
        unsigned SLCT1                  :1;
    };
} CLCSELECTbits_t;
extern volatile CLCSELECTbits_t CLCSELECTbits __at(0x696);
// bitfield macros
#define _CLCSELECT_SLCT_POSN                                0x0
#define _CLCSELECT_SLCT_POSITION                            0x0
#define _CLCSELECT_SLCT_SIZE                                0x8
#define _CLCSELECT_SLCT_LENGTH                              0x8
#define _CLCSELECT_SLCT_MASK                                0xFF
#define _CLCSELECT_SLCT0_POSN                               0x0
#define _CLCSELECT_SLCT0_POSITION                           0x0
#define _CLCSELECT_SLCT0_SIZE                               0x1
#define _CLCSELECT_SLCT0_LENGTH                             0x1
#define _CLCSELECT_SLCT0_MASK                               0x1
#define _CLCSELECT_SLCT1_POSN                               0x1
#define _CLCSELECT_SLCT1_POSITION                           0x1
#define _CLCSELECT_SLCT1_SIZE                               0x1
#define _CLCSELECT_SLCT1_LENGTH                             0x1
#define _CLCSELECT_SLCT1_MASK                               0x2

// Register: CLCDATA
#define CLCDATA CLCDATA
extern volatile unsigned char           CLCDATA             __at(0x697);
#ifndef _LIB_BUILD
asm("CLCDATA equ 0697h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLC1OUT                :1;
        unsigned CLC2OUT                :1;
        unsigned CLC3OUT                :1;
        unsigned CLC4OUT                :1;
    };
} CLCDATAbits_t;
extern volatile CLCDATAbits_t CLCDATAbits __at(0x697);
// bitfield macros
#define _CLCDATA_CLC1OUT_POSN                               0x0
#define _CLCDATA_CLC1OUT_POSITION                           0x0
#define _CLCDATA_CLC1OUT_SIZE                               0x1
#define _CLCDATA_CLC1OUT_LENGTH                             0x1
#define _CLCDATA_CLC1OUT_MASK                               0x1
#define _CLCDATA_CLC2OUT_POSN                               0x1
#define _CLCDATA_CLC2OUT_POSITION                           0x1
#define _CLCDATA_CLC2OUT_SIZE                               0x1
#define _CLCDATA_CLC2OUT_LENGTH                             0x1
#define _CLCDATA_CLC2OUT_MASK                               0x2
#define _CLCDATA_CLC3OUT_POSN                               0x2
#define _CLCDATA_CLC3OUT_POSITION                           0x2
#define _CLCDATA_CLC3OUT_SIZE                               0x1
#define _CLCDATA_CLC3OUT_LENGTH                             0x1
#define _CLCDATA_CLC3OUT_MASK                               0x4
#define _CLCDATA_CLC4OUT_POSN                               0x3
#define _CLCDATA_CLC4OUT_POSITION                           0x3
#define _CLCDATA_CLC4OUT_SIZE                               0x1
#define _CLCDATA_CLC4OUT_LENGTH                             0x1
#define _CLCDATA_CLC4OUT_MASK                               0x8

