MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13275/mcu.h
extern volatile RD5PPSbits_t RD5PPSbits __at(0x1DA9);
// bitfield macros
#define _RD5PPS_RD5PPS_POSN                                 0x0
#define _RD5PPS_RD5PPS_POSITION                             0x0
#define _RD5PPS_RD5PPS_SIZE                                 0x6
#define _RD5PPS_RD5PPS_LENGTH                               0x6
#define _RD5PPS_RD5PPS_MASK                                 0x3F

// Register: RD6PPS
#define RD6PPS RD6PPS
extern volatile unsigned char           RD6PPS              __at(0x1DAA);
#ifndef _LIB_BUILD
asm("RD6PPS equ 01DAAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD6PPS                 :6;
    };
} RD6PPSbits_t;
extern volatile RD6PPSbits_t RD6PPSbits __at(0x1DAA);
// bitfield macros
#define _RD6PPS_RD6PPS_POSN                                 0x0
#define _RD6PPS_RD6PPS_POSITION                             0x0
#define _RD6PPS_RD6PPS_SIZE                                 0x6
#define _RD6PPS_RD6PPS_LENGTH                               0x6
#define _RD6PPS_RD6PPS_MASK                                 0x3F

// Register: RD7PPS
#define RD7PPS RD7PPS
extern volatile unsigned char           RD7PPS              __at(0x1DAB);
#ifndef _LIB_BUILD
asm("RD7PPS equ 01DABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD7PPS                 :6;
    };
} RD7PPSbits_t;
extern volatile RD7PPSbits_t RD7PPSbits __at(0x1DAB);
// bitfield macros
#define _RD7PPS_RD7PPS_POSN                                 0x0
#define _RD7PPS_RD7PPS_POSITION                             0x0
#define _RD7PPS_RD7PPS_SIZE                                 0x6
#define _RD7PPS_RD7PPS_LENGTH                               0x6
#define _RD7PPS_RD7PPS_MASK                                 0x3F

// Register: RE0PPS
#define RE0PPS RE0PPS
extern volatile unsigned char           RE0PPS              __at(0x1DAC);
#ifndef _LIB_BUILD
asm("RE0PPS equ 01DACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0PPS                 :6;
    };
} RE0PPSbits_t;
extern volatile RE0PPSbits_t RE0PPSbits __at(0x1DAC);
// bitfield macros
#define _RE0PPS_RE0PPS_POSN                                 0x0
#define _RE0PPS_RE0PPS_POSITION                             0x0
#define _RE0PPS_RE0PPS_SIZE                                 0x6
#define _RE0PPS_RE0PPS_LENGTH                               0x6
#define _RE0PPS_RE0PPS_MASK                                 0x3F

// Register: RE1PPS
#define RE1PPS RE1PPS
extern volatile unsigned char           RE1PPS              __at(0x1DAD);
#ifndef _LIB_BUILD
asm("RE1PPS equ 01DADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE1PPS                 :6;
    };
} RE1PPSbits_t;
extern volatile RE1PPSbits_t RE1PPSbits __at(0x1DAD);
// bitfield macros
#define _RE1PPS_RE1PPS_POSN                                 0x0
#define _RE1PPS_RE1PPS_POSITION                             0x0
#define _RE1PPS_RE1PPS_SIZE                                 0x6
#define _RE1PPS_RE1PPS_LENGTH                               0x6
#define _RE1PPS_RE1PPS_MASK                                 0x3F

// Register: RE2PPS
#define RE2PPS RE2PPS
extern volatile unsigned char           RE2PPS              __at(0x1DAE);
#ifndef _LIB_BUILD
asm("RE2PPS equ 01DAEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE2PPS                 :6;
    };
} RE2PPSbits_t;
extern volatile RE2PPSbits_t RE2PPSbits __at(0x1DAE);
// bitfield macros
#define _RE2PPS_RE2PPS_POSN                                 0x0
#define _RE2PPS_RE2PPS_POSITION                             0x0
#define _RE2PPS_RE2PPS_SIZE                                 0x6
#define _RE2PPS_RE2PPS_LENGTH                               0x6
#define _RE2PPS_RE2PPS_MASK                                 0x3F

// Register: TRISC0PPS
#define TRISC0PPS TRISC0PPS
extern volatile unsigned char           TRISC0PPS           __at(0x1DD0);
#ifndef _LIB_BUILD
asm("TRISC0PPS equ 01DD0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC0PPS              :6;
    };
} TRISC0PPSbits_t;
extern volatile TRISC0PPSbits_t TRISC0PPSbits __at(0x1DD0);
// bitfield macros
#define _TRISC0PPS_TRISC0PPS_POSN                           0x0
#define _TRISC0PPS_TRISC0PPS_POSITION                       0x0
#define _TRISC0PPS_TRISC0PPS_SIZE                           0x6
#define _TRISC0PPS_TRISC0PPS_LENGTH                         0x6
#define _TRISC0PPS_TRISC0PPS_MASK                           0x3F

// Register: TRISC1PPS
#define TRISC1PPS TRISC1PPS
extern volatile unsigned char           TRISC1PPS           __at(0x1DD1);
#ifndef _LIB_BUILD
asm("TRISC1PPS equ 01DD1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC1PPS              :6;
    };
} TRISC1PPSbits_t;
extern volatile TRISC1PPSbits_t TRISC1PPSbits __at(0x1DD1);
// bitfield macros
#define _TRISC1PPS_TRISC1PPS_POSN                           0x0
#define _TRISC1PPS_TRISC1PPS_POSITION                       0x0
#define _TRISC1PPS_TRISC1PPS_SIZE                           0x6
#define _TRISC1PPS_TRISC1PPS_LENGTH                         0x6
#define _TRISC1PPS_TRISC1PPS_MASK                           0x3F

// Register: TRISC2PPS
#define TRISC2PPS TRISC2PPS
extern volatile unsigned char           TRISC2PPS           __at(0x1DD2);
#ifndef _LIB_BUILD
asm("TRISC2PPS equ 01DD2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC2PPS              :6;
    };
} TRISC2PPSbits_t;
extern volatile TRISC2PPSbits_t TRISC2PPSbits __at(0x1DD2);
// bitfield macros
#define _TRISC2PPS_TRISC2PPS_POSN                           0x0
#define _TRISC2PPS_TRISC2PPS_POSITION                       0x0
#define _TRISC2PPS_TRISC2PPS_SIZE                           0x6
#define _TRISC2PPS_TRISC2PPS_LENGTH                         0x6
#define _TRISC2PPS_TRISC2PPS_MASK                           0x3F

// Register: TRISC3PPS
#define TRISC3PPS TRISC3PPS
extern volatile unsigned char           TRISC3PPS           __at(0x1DD3);
#ifndef _LIB_BUILD
asm("TRISC3PPS equ 01DD3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC3PPS              :6;
    };
} TRISC3PPSbits_t;
extern volatile TRISC3PPSbits_t TRISC3PPSbits __at(0x1DD3);
// bitfield macros
#define _TRISC3PPS_TRISC3PPS_POSN                           0x0
#define _TRISC3PPS_TRISC3PPS_POSITION                       0x0
#define _TRISC3PPS_TRISC3PPS_SIZE                           0x6
#define _TRISC3PPS_TRISC3PPS_LENGTH                         0x6
#define _TRISC3PPS_TRISC3PPS_MASK                           0x3F

