MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13275/mcu.h
// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
extern volatile unsigned char           CLCIN0PPS           __at(0x1E3D);
#ifndef _LIB_BUILD
asm("CLCIN0PPS equ 01E3Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN0PPS              :7;
    };
} CLCIN0PPSbits_t;
extern volatile CLCIN0PPSbits_t CLCIN0PPSbits __at(0x1E3D);
// bitfield macros
#define _CLCIN0PPS_CLCIN0PPS_POSN                           0x0
#define _CLCIN0PPS_CLCIN0PPS_POSITION                       0x0
#define _CLCIN0PPS_CLCIN0PPS_SIZE                           0x7
#define _CLCIN0PPS_CLCIN0PPS_LENGTH                         0x7
#define _CLCIN0PPS_CLCIN0PPS_MASK                           0x7F

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
extern volatile unsigned char           CLCIN1PPS           __at(0x1E3E);
#ifndef _LIB_BUILD
asm("CLCIN1PPS equ 01E3Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN1PPS              :7;
    };
} CLCIN1PPSbits_t;
extern volatile CLCIN1PPSbits_t CLCIN1PPSbits __at(0x1E3E);
// bitfield macros
#define _CLCIN1PPS_CLCIN1PPS_POSN                           0x0
#define _CLCIN1PPS_CLCIN1PPS_POSITION                       0x0
#define _CLCIN1PPS_CLCIN1PPS_SIZE                           0x7
#define _CLCIN1PPS_CLCIN1PPS_LENGTH                         0x7
#define _CLCIN1PPS_CLCIN1PPS_MASK                           0x7F

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
extern volatile unsigned char           CLCIN2PPS           __at(0x1E3F);
#ifndef _LIB_BUILD
asm("CLCIN2PPS equ 01E3Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN2PPS              :7;
    };
} CLCIN2PPSbits_t;
extern volatile CLCIN2PPSbits_t CLCIN2PPSbits __at(0x1E3F);
// bitfield macros
#define _CLCIN2PPS_CLCIN2PPS_POSN                           0x0
#define _CLCIN2PPS_CLCIN2PPS_POSITION                       0x0
#define _CLCIN2PPS_CLCIN2PPS_SIZE                           0x7
#define _CLCIN2PPS_CLCIN2PPS_LENGTH                         0x7
#define _CLCIN2PPS_CLCIN2PPS_MASK                           0x7F

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
extern volatile unsigned char           CLCIN3PPS           __at(0x1E40);
#ifndef _LIB_BUILD
asm("CLCIN3PPS equ 01E40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN3PPS              :7;
    };
} CLCIN3PPSbits_t;
extern volatile CLCIN3PPSbits_t CLCIN3PPSbits __at(0x1E40);
// bitfield macros
#define _CLCIN3PPS_CLCIN3PPS_POSN                           0x0
#define _CLCIN3PPS_CLCIN3PPS_POSITION                       0x0
#define _CLCIN3PPS_CLCIN3PPS_SIZE                           0x7
#define _CLCIN3PPS_CLCIN3PPS_LENGTH                         0x7
#define _CLCIN3PPS_CLCIN3PPS_MASK                           0x7F

// Register: CK1PPS
#define CK1PPS CK1PPS
extern volatile unsigned char           CK1PPS              __at(0x1E41);
#ifndef _LIB_BUILD
asm("CK1PPS equ 01E41h");
#endif
// aliases
extern volatile unsigned char           RX1DTPPS            __at(0x1E41);
#ifndef _LIB_BUILD
asm("RX1DTPPS equ 01E41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CK1PPS                 :7;
    };
} CK1PPSbits_t;
extern volatile CK1PPSbits_t CK1PPSbits __at(0x1E41);
// bitfield macros
#define _CK1PPS_CK1PPS_POSN                                 0x0
#define _CK1PPS_CK1PPS_POSITION                             0x0
#define _CK1PPS_CK1PPS_SIZE                                 0x7
#define _CK1PPS_CK1PPS_LENGTH                               0x7
#define _CK1PPS_CK1PPS_MASK                                 0x7F
// alias bitfield definitions
typedef union {
    struct {
        unsigned CK1PPS                 :7;
    };
} RX1DTPPSbits_t;
extern volatile RX1DTPPSbits_t RX1DTPPSbits __at(0x1E41);
// bitfield macros
#define _RX1DTPPS_CK1PPS_POSN                               0x0
#define _RX1DTPPS_CK1PPS_POSITION                           0x0
#define _RX1DTPPS_CK1PPS_SIZE                               0x7
#define _RX1DTPPS_CK1PPS_LENGTH                             0x7
#define _RX1DTPPS_CK1PPS_MASK                               0x7F

// Register: RX1PPS
#define RX1PPS RX1PPS
extern volatile unsigned char           RX1PPS              __at(0x1E42);
#ifndef _LIB_BUILD
asm("RX1PPS equ 01E42h");
#endif
// aliases
extern volatile unsigned char           TX1CKPPS            __at(0x1E42);
#ifndef _LIB_BUILD
asm("TX1CKPPS equ 01E42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX1PPS                 :7;
    };
} RX1PPSbits_t;
extern volatile RX1PPSbits_t RX1PPSbits __at(0x1E42);
// bitfield macros
#define _RX1PPS_RX1PPS_POSN                                 0x0
#define _RX1PPS_RX1PPS_POSITION                             0x0
#define _RX1PPS_RX1PPS_SIZE                                 0x7
#define _RX1PPS_RX1PPS_LENGTH                               0x7
#define _RX1PPS_RX1PPS_MASK                                 0x7F
// alias bitfield definitions
typedef union {
    struct {
        unsigned RX1PPS                 :7;
    };
} TX1CKPPSbits_t;
extern volatile TX1CKPPSbits_t TX1CKPPSbits __at(0x1E42);
// bitfield macros
#define _TX1CKPPS_RX1PPS_POSN                               0x0
#define _TX1CKPPS_RX1PPS_POSITION                           0x0
#define _TX1CKPPS_RX1PPS_SIZE                               0x7
#define _TX1CKPPS_RX1PPS_LENGTH                             0x7
#define _TX1CKPPS_RX1PPS_MASK                               0x7F

// Register: CK2PPS
#define CK2PPS CK2PPS
extern volatile unsigned char           CK2PPS              __at(0x1E43);
#ifndef _LIB_BUILD
asm("CK2PPS equ 01E43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CK2PPS                 :7;
    };
} CK2PPSbits_t;
extern volatile CK2PPSbits_t CK2PPSbits __at(0x1E43);
// bitfield macros
#define _CK2PPS_CK2PPS_POSN                                 0x0
#define _CK2PPS_CK2PPS_POSITION                             0x0
#define _CK2PPS_CK2PPS_SIZE                                 0x7
#define _CK2PPS_CK2PPS_LENGTH                               0x7
#define _CK2PPS_CK2PPS_MASK                                 0x7F

// Register: RX2PPS
#define RX2PPS RX2PPS
extern volatile unsigned char           RX2PPS              __at(0x1E44);
#ifndef _LIB_BUILD
asm("RX2PPS equ 01E44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX2PPS                 :7;
    };
} RX2PPSbits_t;
extern volatile RX2PPSbits_t RX2PPSbits __at(0x1E44);
// bitfield macros
#define _RX2PPS_RX2PPS_POSN                                 0x0
#define _RX2PPS_RX2PPS_POSITION                             0x0
#define _RX2PPS_RX2PPS_SIZE                                 0x7
#define _RX2PPS_RX2PPS_LENGTH                               0x7
#define _RX2PPS_RX2PPS_MASK                                 0x7F

